src/AccumulationRegisters/ТранспортнаяЛогистикаДоставка/ТранспортнаяЛогистикаДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТранспортнаяЛогистикаДоставка</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тоннаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВРейсе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67fc19c3-1b39-455a-a36d-977ccc7986e6">
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fac2f68b-89ca-4292-ac3f-e6803b093aec">
    <name>ГосударственныйОрган</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="56ba8e3c-152e-472e-978c-1c8a27110815">
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="62afa2d4-135f-44b9-aeb8-d536b15d0b0f">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5d5825e6-3ce4-45b1-b381-4ca2c180c292">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5f2d0eed-be8d-428e-b069-3c1f0e091139">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ed3160d7-bf41-4fa7-b0c0-314e4b913418">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="822dc11f-971f-42ce-bea9-d73bd3da4fba">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="66f390f7-3e60-482a-aeb1-c99f1f343346">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="45d2eecb-2dd4-4f02-9eec-3b4f3eae095f">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1a44c1d6-4cdc-42bb-8de5-d50750ac626d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/УправлениеВозвратнойТарой/Module.bsl
Функция ВернутьТаблицуПередачиТарыВодителю(Дата, Маршрут, Водитель, Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортнаяЛогистикаДоставкаОбороты.Организация КАК Организация,
	               |	НоменклатураВозвратнойТары.ВозвратнаяТара КАК ВозвратнаяТара,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ НоменклатураВозвратнойТары.КоличествоВМесте ЕСТЬ NULL
	               |					И НоменклатураВозвратнойТары.КоличествоВМесте > 0
	               |				ТОГДА ТранспортнаяЛогистикаДоставкаОбороты.КоличествоОборот / НоменклатураВозвратнойТары.КоличествоВМесте
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ТранспортнаяЛогистикаДоставка.Обороты(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Регистратор, Маршрут = &Маршрут) КАК ТранспортнаяЛогистикаДоставкаОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВидыТарыНоменклатура.Ссылка.ВозвратнаяТара КАК ВозвратнаяТара,
	               |			ВидыТарыНоменклатура.Номенклатура КАК Номенклатура,
	               |			ВидыТарыНоменклатура.КоличествоВМесте КАК КоличествоВМесте
	               |		ИЗ
	               |			Справочник.ВидыМногооборотнойТары.Номенклатура КАК ВидыТарыНоменклатура) КАК НоменклатураВозвратнойТары
	               |		ПО ТранспортнаяЛогистикаДоставкаОбороты.Номенклатура = НоменклатураВозвратнойТары.Номенклатура
	               |ГДЕ
	               |	НоменклатураВозвратнойТары.ВозвратнаяТара <> ЗНАЧЕНИЕ(Справочник.ВидыМногооборотнойТары.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТранспортнаяЛогистикаДоставкаОбороты.Организация,
	               |	НоменклатураВозвратнойТары.ВозвратнаяТара";
	
	Запрос.УстановитьПараметр("Дата"                         , Дата       );
	Запрос.УстановитьПараметр("Маршрут"                      , Маршрут    );
	Запрос.УстановитьПараметр("Водитель"                     , Водитель   );
	Запрос.УстановитьПараметр("Автомобиль"                   , Автомобиль );
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

Функция ВернутьТаблицуПередачиТарыКонтрагентам(Дата, Маршрут, Водитель, Автомобиль) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортнаяЛогистикаПоДокументам.Документ КАК Документ,
	               |	ТранспортнаяЛогистикаПоДокументам.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ ЗаказыПокупателей
	               |ИЗ
	               |	РегистрСведений.ТранспортнаяЛогистикаПоДокументам КАК ТранспортнаяЛогистикаПоДокументам
	               |ГДЕ
	               |	ТранспортнаяЛогистикаПоДокументам.Маршрут = &Маршрут
	               |	И ТранспортнаяЛогистикаПоДокументам.Водитель = &Водитель
	               |	И ТранспортнаяЛогистикаПоДокументам.Автомобиль = &Автомобиль
	               |	И ТранспортнаяЛогистикаПоДокументам.Документ ССЫЛКА Документ.ЗаказПокупателя
	               |	И НАЧАЛОПЕРИОДА(ТранспортнаяЛогистикаПоДокументам.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И ТранспортнаяЛогистикаПоДокументам.Документ.ДоговорКонтрагента.УчитыватьВозвратнуюТаруКонтрагента = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТранспортнаяЛогистикаПоДокументам.Документ,
	               |	ТранспортнаяЛогистикаПоДокументам.Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА ПродажиОбороты.Регистратор.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ПродажиОбороты.Контрагент
	               |		ИНАЧЕ ПродажиОбороты.Регистратор.Грузополучатель
	               |	КОНЕЦ КАК Контрагент,
	               |	ПродажиОбороты.ДокументПродажи КАК Документ,
	               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	               |	ПродажиОбороты.КоличествоОборот КАК Количество
	               |ПОМЕСТИТЬ ПродажиНоменклатуры
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Регистратор, ) КАК ПродажиОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказыПокупателей КАК ЗаказыПокупателей
	               |		ПО ПродажиОбороты.ЗаказПокупателя = ЗаказыПокупателей.Документ
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И ПродажиОбороты.ДоговорКонтрагента.УчитыватьВозвратнуюТаруКонтрагента = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиНоменклатуры.Организация КАК Организация,
	               |	ПродажиНоменклатуры.Контрагент КАК Грузополучатель,
	               |	ПродажиНоменклатуры.Документ КАК Документ,
	               |	НоменклатураВозвратнойТары.ВозвратнаяТара КАК ВозвратнаяТара,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ НоменклатураВозвратнойТары.КоличествоВМесте ЕСТЬ NULL
	               |					И НоменклатураВозвратнойТары.КоличествоВМесте > 0
	               |				ТОГДА ПродажиНоменклатуры.Количество / НоменклатураВозвратнойТары.КоличествоВМесте
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Количество
	               |ИЗ
	               |	ПродажиНоменклатуры КАК ПродажиНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВидыТарыНоменклатура.Ссылка.ВозвратнаяТара КАК ВозвратнаяТара,
	               |			ВидыТарыНоменклатура.Номенклатура КАК Номенклатура,
	               |			ВидыТарыНоменклатура.КоличествоВМесте КАК КоличествоВМесте
	               |		ИЗ
	               |			Справочник.ВидыТары.Номенклатура КАК ВидыТарыНоменклатура) КАК НоменклатураВозвратнойТары
	               |		ПО ПродажиНоменклатуры.Номенклатура = НоменклатураВозвратнойТары.Номенклатура
	               |ГДЕ
	               |	НоменклатураВозвратнойТары.ВозвратнаяТара <> ЗНАЧЕНИЕ(Справочник.ВидыТары.ПустаяСсылка)
	               |	И ВЫБОР
	               |			КОГДА НЕ НоменклатураВозвратнойТары.КоличествоВМесте ЕСТЬ NULL
	               |					И НоменклатураВозвратнойТары.КоличествоВМесте > 0
	               |				ТОГДА ПродажиНоменклатуры.Количество / НоменклатураВозвратнойТары.КоличествоВМесте
	               |			ИНАЧЕ 0
	               |		КОНЕЦ >= 0.45
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиНоменклатуры.Организация,
	               |	НоменклатураВозвратнойТары.ВозвратнаяТара,
	               |	ПродажиНоменклатуры.Контрагент,
	               |	ПродажиНоменклатуры.Документ";
	
	Запрос.УстановитьПараметр("Дата"      , Дата       );
	Запрос.УстановитьПараметр("Маршрут"   , Маршрут    );
	Запрос.УстановитьПараметр("Водитель"  , Водитель   );
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль );
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

Процедура ДополнитьТаблицуТоваровВозвратнойТарой(ДокументСсылка, ТаблицаТовары) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВозвратнаяТараДолжникиОбороты.КоличествоОборот) КАК Количество,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара КАК Номенклатура,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков.Наименование КАК БазоваяЕдиницаНаименование,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	               |	ЛОЖЬ КАК ЕстьСкидкиПоСтроке,
	               |	0 КАК КоличествоМест,
	               |	0 КАК КоличествоВОдномМесте,
	               |	0 КАК МассаБрутто,
	               |	0 КАК Цена,
	               |	0 КАК Сумма,
	               |	0 КАК СуммаНДС,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.Код КАК ТоварКод,
	               |	ВЫРАЗИТЬ(ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	               |	2 КАК Метка,
	               |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС
	               |ИЗ
	               |	РегистрНакопления.ВозвратнаяТараДолжники.Обороты(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Регистратор, ) КАК ВозвратнаяТараДолжникиОбороты
	               |ГДЕ
	               |	ВозвратнаяТараДолжникиОбороты.РасчетныйДокумент = &ДокументСсылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков.Коэффициент,
	               |	ВЫРАЗИТЬ(ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.НаименованиеПолное КАК СТРОКА(200)),
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.Код,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков.Наименование,
	               |	ВозвратнаяТараДолжникиОбороты.ВозвратнаяТара.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код";
	
	Запрос.УстановитьПараметр("Дата"          , ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	СчетчикСтрок = ТаблицаТовары.Количество();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока  = ТаблицаТовары.Добавить();
		СчетчикСтрок = СчетчикСтрок + 1;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.НомерСтроки = СчетчикСтрок;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьДвиженияПродажПоДоговору(ДоговорКонтрагента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(, , Регистратор, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 0;
	
КонецФункции

Функция НоменклатураЯвляетсяВозвратнойТарой(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыТары.Ссылка
	               |ИЗ
	               |	Справочник.ВидыТары КАК ВидыТары
	               |ГДЕ
	               |	ВидыТары.ВозвратнаяТара = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

//&НаСервереБезКонтекста
Процедура ВозвратнаяТараАвтоПодбор(ДанныеВыбора, СтандартнаяОбработка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыТарыНоменклатура.Ссылка.ВозвратнаяТара
	               |ИЗ
	               |	Справочник.ВидыМногооборотнойТары.Номенклатура КАК ВидыТарыНоменклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВидыТарыНоменклатура.Ссылка.ВозвратнаяТара";
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВозвратнаяТара"));
	
	Если ДанныеВыбора.Количество() > 0 тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры
